[
{"name": "Turkey", "data": "\r\n• The Electronic Visa (e-Visa) Application System was launched on 17 April 2013 by the Ministry of Foreign Affairs of the Republic of Turkey. This system allows visitors travelling to Turkey to easily obtain their e-Visas online (www.evisa.gov.tr), in approximately three minutes. \r\n\r\nIt is possible to obtain e-Visa 7/24 at everywhere with internet connection. The applicants can obtain their visa after they fill in the necessary information concerning their identity, passport and travel dates and pay visa fee online. \r\n\r\n• Please note that e-visa is only valid when the purpose of travel is tourism or commerce. For other purposes, such as work and study, visas are given by Turkish Embassies or Consulates. \r\n\r\n• The term \"official passports\" covers diplomatic, service, special and official passports. \r\n\r\nYou are kindly advised to have a travel document/passport valid for at least 6 months as from the date of your arrival in Turkey. \r\n\r\nThe Ministry of Foreign Affairs continues efforts to strengthen the e-Visa system and to better enable foreign nationals to easily obtain their visas. \r\n\r\nIn this context, \r\n\r\n- In addition to English, French, and Spanish; Dutch, Norwegian, Polish, German, Arabic and Chinese language options will be added to the e-Visa system. \r\n\r\n- In addition to Visa and Master Card, payment is accepted from other commonly used credit cards and debit cards. \r\n- Tour operators may apply for group e-Visas and make lump sum payments for them. \r\n\r\n\r\n- Necessary arrangements will be made to allow foreign visitors to obtain e-Visas from authorized airline companies offices, including those companies’ offices in airports. \r\n\r\n- Fees for e-Visas obtained via the e-Visa website (www.evisa.gov.tr) are lower than the fees for visas obtained upon arrival to Turkish airports. Information regarding visa fees can be found on the website of the Ministry of Foreign Affairs.(http://www.mfa.gov.tr/data/KONSOLOSLUK/vize-harc-miktarlari-en.pdf). \r\n\r\nVisa regime for truck drivers of a country may differ from the overall visa regime effective for citizens of that particular country. For further information, please contact the nearest Turkish mission. \r\n\r\nRegardless of the visa regime applied towards the citizens of a country, the travel document holders of that country need to obtain visa from Turkish missions beforehand. \r\n\r\nForeigners who will shoot a documentary film conduct a research or an archeological excavation should get a special permission from the Turkish authorities in advance. \r\n\r\nIf you have a valid visa, you do not need a residence permit up to 90 days. On the other hand, foreigners who shall reside, work or study in Turkey, should register themselves at the nearest local police department upon their arrival in Turkey, regardless of the validity of their visa. \r\n\r\nInformation on Work Visa: To work in Turkey, you must apply to the nearest Turkish mission to obtain work permit and visa. Your passport, visa application form and a letter from your employer are the necessary documents for your application. Other documents should be submitted to the Turkish Ministry of Labour and Social Security (MLSS) by your employer within ten working days after your application. \r\n\r\nYou may find the list of those documents in the MLSS’s website (http://www.csgb.gov.tr). Applications are finalized by the MLSS within thirty days at the latest. Right after your arrival in Turkey (before starting to work), you should be registered at the local police department within one month to obtain the necessary residence permit. \r\n\r\nAs of 1 January 2015, in accordance with the article 7.1b of “the Law on Foreigners and International Protection” no. 6458, foreigners wishing to enter Turkey should carry a travel document (passport) with an expiration date at least 60 days beyond the “duration of stay” of their visa, e-Visa, visa exemption, or residence permit. \r\n\r\nThe citizens of the countries which are stated at the below link are exempted form this Article; \r\n\r\nExample A: In order to enter Turkey having a visa with 90 days “duration of stay”, foreigners should hold a travel document valid at least for an additional 60 days which totals to 150 days (90 days + 60 days) of validity at the time of entrance. \r\n\r\nExample B: In order to enter Turkey having a visa with 30 days “duration of stay”, foreigners should hold a travel document valid at least for an additional 60 days which totals to 90 days (30 days + 60 days) of validity at the time of entrance.\" \r\n\r\nThe following categories are exempted from this provision: \r\n\r\n- Citizens of countries who are allowed to enter Turkey with their national ID’s in accordance with “European Agreement on Regulations governing the Movement of Persons between Member States of the Council of Europe”,\r\n\r\nhttp://www.mfa.gov.tr/countries-whose-citizens-are-allowed-to-enter-turkey-with-their-national-id_s.en.mfa\r\n"}
]