[
{"name": "America", "visit_visa": "<div id=\"main-content\" class=\"editable\"><h2>Exchange Visitor Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#Dependents\">Dependents</a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#SupportingDocumentsforDependents\">Supporting Documents for Dependents</a></li>\n<li><a href=\"#MoreInformation\">More Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistj\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>The United States welcomes foreign citizens who come to the United States to participate in exchange programs. Before applying for a visa, all exchange visitor applicants are required to be accepted and approved by an authorized program sponsor. When accepted, the applicant will receive from the educational institution or program sponsors the necessary approval documentation to be submitted when applying for a visa.</p>\n<p>The exchange visitor program's J visa is designed to promote the interchange of persons, knowledge, and skills in the fields of education, arts, and sciences. Participants include students at all academic levels; trainees obtaining on-the-job training with firms, institutions, and agencies; teachers of primary, secondary, and specialized schools; professors coming to teach or do research at institutions of higher learning; research scholars; professional trainees in the medical and allied fields; and international visitors coming for the purpose of travel, observation, consultation, research, training, sharing, or demonstrating specialized knowledge or skills, or participating in organized people-to-people programs.</p>\n<h4 id=\"Dependents\">Dependents</h4>\n<p>Spouses or unmarried children under the age of 21 who wish to accompany or join the principal visa holder of a J-1 visa to the United States for the duration of his or her stay must have J-2 visas. Spouses or children who do not intend to reside in the United States with the principal visa holder, but who will visit for vacations only, may be eligible to apply for <a href=\"pk-niv-typeb1b2.asp\">visitor (B-2) visas</a>.</p>\n<p>The spouse and/or child of an exchange visitor in the United States may not work while holding a J-2 visa unless they have filed <a href=\"https://uscis.gov/i-765\" target=\"_blank\" rel=\"noopener noreferrer\">Form I-765</a>, Application for Employment Authorization. U.S. Citizenship and Immigration Services (USCIS) must have reviewed the Form I-765 and given permission to the J-2 holder to work. The USCIS website has a PDF document titled <a href=\"http://www.uscis.gov/USCIS/About%20Us/Electronic%20Reading%20Room/Customer%20Service%20Reference%20Guide/Employment_Authorization.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">\"Employment Authorization\"</a> that has more information.</p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>To apply for a J visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>Unless your J program is sponsored by the United States Government (with a program code beginning with a \"G\"), you must present a receipt showing payment of your US$160 non-refundable nonimmigrant visa application processing fee, paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>An approved <a href=\"http://exchanges.state.gov/jexchanges/j-1_visas/ds-2019.html\" target=\"_blank\" rel=\"noopener noreferrer\">DS-2019</a> from your U.S. program.</li>\n<li>Unless your J program is sponsored by the United States Government (with a program code beginning with a \"G\"), you must pay your Form I-901 SEVIS <a href=\"pk-niv-visafeeinfo.asp#OtherFees\"> fee</a>. The SEVIS <a href=\"https://ice.gov/sevis\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> has more information.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<h5>Step 1</h5>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\">U.S. Embassy or Consulate </a> on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months, your current and all old passports, and the original visa fee payment receipt. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>Supporting documents are only one of many factors a consular officer will consider in your interview. Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of your information.</p>\n<p>You should bring the following documents to your interview:</p>\n<ul class=\"blue_bullets\">\n<li>Documents demonstrating strong financial, social, and family ties to your home country that will compel you to return to your country after your program of study in the United States ends.</li>\n<li>Financial and any other documents you believe will support your application and which give credible evidence that you have enough readily-available funds to meet all expenses for the first year of study and that you have access to funds sufficient to cover all expenses while you remain in the United States.</li>\n<li>Photocopies of bank statements will not be accepted unless you can also show original copies of bank statements or original bank books.</li>\n<li>If you are financially sponsored by another person, bring proof of your relationship to the sponsor (such as your birth certificate), the sponsor's most recent original tax forms and the sponsor's bankbooks and/or fixed deposit certificates.</li>\n<li>Academic documents that show scholastic preparation. Useful documents include school transcripts (original copies are preferred) with grades, public examination certificates (A-levels, etc.), standardized test scores (SAT, TOEFL, etc.), and diplomas.</li>\n</ul>\n<h4 id=\"SupportingDocumentsforDependents\">Supporting Documents for Dependents</h4>\n<p>If you have dependents, you must also provide:</p>\n<ul class=\"blue_bullets\">\n<li>Proof of your relationship to your spouse and/or child (e.g., marriage and birth certificates).</li>\n<li>Each spouse or child must have their own <a href=\"http://exchanges.state.gov/jexchanges/j-1_visas/ds-2019.html\" target=\"_blank\" rel=\"noopener noreferrer\">Form DS-2019</a>. This form is used to obtain the visa required for the spouse/child to enter the United States with you as the principal holder of an exchange visitor visa, or to join you in the United States at a later date.</li>\n</ul>\n<h4 id=\"MoreInformation\">More Information</h4>\n<p>For more information about visas for exchange visitors, visit the Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/study/exchange.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p></div>", "business_visa": "<div id=\"main-content\" class=\"editable\"><h2>Business/Tourist Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#Qualifications\">Qualifications </a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#SupportingDocumentsforApplicantsSeekingMedicalCare\">Supporting Documents for Applicants Seeking Medical Care</a></li>\n<li><a href=\"#MoreInformation\">More Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistb1b2\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>The B-1/B-2 visitor visa is for people traveling to the United States temporarily for business (B-1) or for pleasure or medical treatment (B-2). Generally, the B-1 visa is for travelers consulting with business associates, attending scientific, educational, professional or business conventions/conferences, settling an estate or negotiating contracts. The B-2 visa is for travel that is recreational in nature, including tourism, visits with friends or relatives, medical treatment and activities of a fraternal, social or service nature. Often, the B-1 and B-2 visas are combined and issued as one visa: the B-1/B-2.</p>\n<h4 id=\"Qualifications\">Qualifications</h4>\n<p>If you apply for a B-1/B-2 visa, you must demonstrate to a consular officer that you qualify for a U.S. visa in accordance with the U.S. Immigration and Nationality Act (INA). Section 214(b) of the INA presumes that every B-1/B-2 applicant is an intending immigrant. You must overcome this legal presumption by showing:</p>\n<ul class=\"blue_bullets\">\n<li>That the purpose of your trip to the United States is for a temporary visit, such as business, pleasure, or medical treatment</li>\n<li>That you plan to remain in the United States for a specific, limited period of time</li>\n<li>Evidence of funds to cover your expenses while in the United States</li>\n<li>That you have a residence outside the United States, as well as other binding social or economic ties, that will ensure your return abroad at the end of your visit</li>\n</ul>\n<p><a href=\"http://islamabad.usembassy.gov/domestic-employee.html\" target=\"_blank\" rel=\"noopener noreferrer\">Personal or domestic employees</a> and crew members working aboard vessels within the Outer Continental Shelf may qualify for B-1 visas under certain circumstances.</p>\n<p>Some foreign nationals may be ineligible for visas according to The Immigration and Nationality Act. You can read more about The Immigration and Nationality Act and visa ineligibility <a href=\"https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/waivers.html\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>If you apply for a business/tourist visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>A receipt showing payment of your US$160 non-refundable nonimmigrant visa application processing fee paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<p>Step 1</p>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\"> U.S. Embassy or Consulate </a>on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months and your current and all old passports. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>Supporting documents are only one of many factors a consular officer will consider in your interview. Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of the information.</p>\n<p>Additionally, based on your purpose of travel, you should consider bringing the following:</p>\n<h5>Students</h5>\n<p>Bring your latest school results, transcripts and degrees/diplomas. Also bring evidence of financial support such as monthly bank statements, fixed deposit slips, or other evidence.</p>\n<h5>Visiting a relative</h5>\n<p>Bring photocopies of your relative's proof of status (e.g. Green Card, naturalization certificate, valid visa, etc).</p>\n<h5>Previous visitors to the United States</h5>\n<p>If you were previously in the United States, any documents attesting to your immigration or visa status.</p>\n<h4 id=\"SupportingDocumentsforApplicantsSeekingMedicalCare\">Supporting Documents for Applicants Seeking Medical Care</h4>\n<p>If you wish to travel to the United States for medical treatment, then you should be prepared to present the following documentation in addition to the documents listed above and those the consular officer may require:</p>\n<ul class=\"blue_bullets\">\n<li>A medical diagnosis from a local physician explaining the nature of your ailment and the reason you require treatment in the United States.</li>\n<li>A letter from a physician or medical facility in the United States expressing a willingness to treat this specific ailment and detailing the projected length and cost of treatment (including doctors' fees, hospitalization fees, and all medical-related expenses).</li>\n<li>A statement of financial responsibility from the individuals or organization paying for your transportation, medical and living expenses. The individuals guaranteeing payment of these expenses must provide proof of their ability to do so, often in the form of bank or other statements of income/savings or certified copies of income tax returns.</li>\n</ul>\n<h4 id=\"MoreInformation\">More Information</h4>\n<p>For more information about business and tourist visas, visit the Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/tourism-visit/visitor.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p></div>", "study_visa": "<div id=\"main-content\" class=\"editable\"><h2>Student Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</a></li>\n<li><a href=\"#U.S.PublicSchools\">U.S. Public Schools</a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#Dependents\">Dependents</a></li>\n<li><a href=\"#OtherInformation\">Other Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistfandm\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>The United States welcomes foreign citizens who come to the United States to study. Before applying for a visa, all student visa applicants are required to be accepted and approved by their school or program. Once accepted, educational institutions will provide each applicant the necessary approval documentation to be submitted when applying for a student visa.</p>\n<h4 id=\"VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</h4>\n<h5>F-1 Visa</h5>\n<p>This is the most common type of student visa. If you wish to engage in academic studies in the United States at an approved school, such as an accredited U.S. college or university, private secondary school, or approved English language program then you need an F-1 visa. You will also need an F-1 visa if your course of study is more than 18 hours a week.</p>\n<h5>M-1 Visa</h5>\n<p>If you plan engage in non-academic or vocational study or training at a U.S. institution then you need an M-1 visa.</p>\n<p>More information about each of these visas and opportunities for studying in the United States can be found at the Education USA <a href=\"https://educationusa.state.gov/\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p>\n<h4 id=\"U.S.PublicSchools\">U.S. Public Schools</h4>\n<p>U.S. law does not permit foreign students to attend public elementary school (kindergarten to 8th grade) or a publicly funded adult education program. Hence, F-1 visas cannot be issued for study at such schools.</p>\n<p>An F-1 visa can be issued for attendance at a public secondary school (grades 9 to 12), but the student is limited to a maximum of 12 months at the school. The school must also indicate on the Form I-20 that the student has paid the unsubsidized cost of the education and the amount submitted by the student for that purpose.</p>\n<p>For more information about F-1 legal requirements, visit the Department of State <a href=\"https://travel.state.gov/content/travel/en/us-visas/study/student-visa/foreign-students-in-public-schools.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p>\n<p><strong>Note:</strong> Holders of A, E, F-2, G, H-4, J-2, L-2, M-2 or other derivative nonimmigrant visas may enroll in public elementary and secondary schools.</p>\n<h5>Student Assistance, Finding a U.S. School</h5>\n<p>Students who hope to enroll in a U.S. educational institution are encouraged to contact and visit <a href=\"https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/all-visa-categories.html\" target=\"_blank\" rel=\"noopener noreferrer\">https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/all-visa-categories.html</a> and <a href=\"https://usefpakistan.org/\" target=\"_blank\" rel=\"noopener noreferrer\">www.usefpakistan.org</a></p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>To apply for an F or M visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>A receipt showing payment of your US$160 non-refundable nonimmigrant visa application processing fee paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>An approved Form I-20 from your U.S. school or program.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<h5>Step 1</h5>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\">U.S. Embassy or Consulate </a>on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months, your current and all old passports, and the original visa fee payment receipt. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>Supporting documents are only one of many factors a consular officer will consider in your interview. Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of your information.</p>\n<p>You should bring the following documents to your interview:</p>\n<ul class=\"blue_bullets\">\n<li>Documents demonstrating strong financial, social, and family ties to your home country that will compel you to return to your country after your program of study in the United States ends.</li>\n<li>Financial and any other documents you believe will support your application and which give credible evidence that you have enough readily-available funds to meet all expenses for the first year of study and that you have access to funds sufficient to cover all expenses while you remain in the United States. M-1 applicants must demonstrate the ability to pay all tuition and living costs for the entire period of their intended stay.</li>\n<li>Photocopies of bank statements will not be accepted unless you can also show original copies of bank statements or original bank books.</li>\n<li>If you are financially sponsored by another person, bring proof of your relationship to the sponsor (such as your birth certificate), the sponsor's most recent original tax forms and the sponsor's bankbooks and/or fixed deposit certificates.</li>\n<li>Academic documents that show scholastic preparation. Useful documents include school transcripts (original copies are preferred) with grades, public examination certificates (A-levels, etc.), standardized test scores (SAT, TOEFL, etc.), and diplomas.</li>\n</ul>\n<h4 id=\"Dependents\">Dependents</h4>\n<p>Spouses and/or unmarried children under the age of 21 who wish to accompany or join the principal visa holder in the United States for the duration of his or her stay require derivative F or M visas. There is no derivative visa for the parents of F or M holders.</p>\n<p>Family members who do not intend to reside in the United States with the principal visa holder, but wish to visit for vacations only, may be eligible to apply for visitor (B-2) visas.</p>\n<p>Spouses and dependents may not work in the United States on a derivative F or M visa. If your spouse/child seeks employment, the spouse must obtain the appropriate work visa.</p>\n<p>Supporting Documents for Dependents</p>\n<p>Applicants with dependents must also provide:</p>\n<ul class=\"blue_bullets\">\n<li>Proof of the student's relationship to his or her spouse and/or child (e.g., marriage and birth certificates)</li>\n<li>It is preferred that families apply for their visas at the same time, but if the spouse and/or child must apply separately at a later time, they should bring a copy of the student visa holder's passport and visa, along with all other required documents.</li>\n</ul>\n<h4 id=\"OtherInformation\">Other Information</h4>\n<h5>Optional Practical Training (OPT)</h5>\n<p>F-1 visa holders may be eligible for up to 12 months of optional practical training following completion of all course requirements for graduation (not including thesis or equivalent), or after completion of all requirements. OPT is separate from a student's academic work, and time for OPT will not normally be reflected during the student's academic program or in the completed study date. Students applying for an F visa to do OPT may present an I-20 with an original end of study date that may have passed. However, these I-20s must be annotated by the designated school official to reflect approval of an OPT program that extends beyond the end of the regular period of study. In addition, the student must have proof that USCIS has approved their practical training program or that an application is pending, either in the form of an approved Employment Authorization Card or a Form I-797 indicating that s/he has a pending application for an OPT program.</p>\n<h5>Validity of Student Visas After a Break in Studies</h5>\n<p>Students who are away from classes for more than five months can expect to apply for and receive a new F-1 or M-1 student visa to return to school following travel abroad, as explained below.</p>\n<h5>Students within the United States</h5>\n<p>A student (F-1 or M-1) may lose that status if they do not resume studies within five months of the date of transferring schools or programs, under immigration law. If a student loses status, unless USCIS reinstates the student's status, the student's F or M visa would also be invalid for future travel returning to the United States. For more information see the USCIS website, and instructions for Application for Extend/Change of Nonimmigrant Status Form I-539 to request reinstatement of status.</p>\n<h5>Students - Returning to the United States from Travel Abroad</h5>\n<p>Students who leave the United States for a break in studies of five months or more may lose their F-1 or M-1 status unless their activities overseas are related to their course of study. In advance of travel, students may want to check with their designated school official, if there is a question about whether their activity is related to their course of study.</p>\n<p>When the Customs and Border Protection (CBP) immigration inspector at port of entry is presented a previously used, unexpired F-1 or M-1 visa by a returning student who has been outside the United States and out of student status for more than five months, a CBP immigration inspector may find the student inadmissible for not possessing a valid nonimmigrant visa. CBP may also cancel the visa after granting the student permission to withdraw the application for admission. Therefore, it is prudent for students to apply for new visas at a U.S. Embassy or Consulate abroad prior to traveling to the United States to return to their studies, after an absence of more than five months that is not related to their course of study.</p></div>", "employment_visa": "<div id=\"main-content\" class=\"editable\"><h2>Work Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</a></li>\n<li><a href=\"#WhentoApply\">When to Apply</a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#Dependents\">Dependents</a></li>\n<li><a href=\"#MoreInformation\">More Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistwork\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>If you want to work in the U.S. temporarily as a nonimmigrant, under U.S. immigration law, you need a specific visa based on the type of work you will be doing. Most temporary worker categories require that your prospective employer or agent file a petition, which must be approved by the U.S. Citizenship and Immigration Services (USCIS) in the United States before you can apply for a work visa.</p>\n<p>All applicants for H, L, O, P and Q visas must have a petition approved on their behalf by USCIS. The petition, <a href=\"https://uscis.gov/i-129\" target=\"_blank\" rel=\"noopener noreferrer\">Form I-129</a>, must be approved before you can apply for a work visa at the U.S. Embassy or Consulate. When your petition is approved, your employer or agent will receive a Notice of Action, Form I-797, which serves as your petition's approval notification. The consular officer will verify your petition approval through the Department of State's Petition Information Management Service (PIMS) during your interview.</p>\n<p class=\"cms-float-left\" style=\"text-align: left;\">You must bring your I-129 petition receipt number to your interview at the U.S. Embassy or Consulate in order to verify your petition's approval. Please note that approval of a petition does not guarantee issuance of a visa if you are found to be ineligible for a visa under U.S. immigration law.</p>\n<h4 id=\"VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</h4>\n<h5>H-1B (specialty occupation)</h5>\n<p>An H-1B visa is required if you are coming to the United States to perform services in a pre-arranged professional job. To qualify, you must hold a bachelor's or higher degree (or an equivalent degree) in the specific specialty for which you seek employment. USCIS will determine whether your employment constitutes a specialty occupation and whether you are qualified to perform the services. Your employer is required file a labor condition application with the Department of Labor concerning the terms and conditions of its contract of employment with you.</p>\n<p style=\"margin: 0px 0px 0.8em; padding: 0px; border: 0px currentColor; text-align: justify; color: #222222; text-transform: none; text-indent: 0px; letter-spacing: normal; font-family: arial; font-size: 12px; font-style: normal; font-weight: normal; word-spacing: 0px; vertical-align: baseline; white-space: normal; orphans: 2; widows: 2; background-color: #ffffff; font-variant-ligatures: normal; font-variant-caps: normal; -webkit-text-stroke-width: 0px;\"><strong style=\"font-weight: bold;\">H-1B1 Treaty-based Temporary Work Visas</strong><br>Free trade agreements signed with Chile and Singapore permit qualified Chilean and Singaporean citizens to temporarily work in the United States in certain circumstances. Only Chilean and Singaporean citizens are eligible as principal applicants, although their spouses and children may be nationals of other countries.</p>\n<p>Applicants for H-1B1 visas should already have a job offer from an employer in their chosen work area in the United States, but the employer does not have to file Form I-129, Petition for Nonimmigrant Worker, and the applicant does not need to obtain a Notice of Approval, Form I-797 form before submitting the visa application. However, the petitioner does need to file an Application for Foreign Labor Certification with the Department of Labor prior to applying for the visa. For more information on the H-1B1 visa, please visit <a href=\"https://travel.state.gov/content/travel/en/us-visas/employment/temporary-worker-visas.html\" target=\"_blank\" rel=\"noopener noreferrer\">this page</a>.</p>\n<h5>H-2A (seasonal agricultural workers)</h5>\n<p>An H-2A visa allows U.S. employers to bring foreign nationals to the United States to fill temporary agricultural jobs for which U.S. workers are not available. An H-2A nonimmigrant classification applies to you if you seek to perform agricultural labor or services of a temporary or seasonal nature in the United States on a temporary basis. A U.S. employer (or an association of U.S. agricultural producers named as a joint employer) must file a Form I-129, Petition for Nonimmigrant Worker, on your behalf.</p>\n<h5>H-2B visa (skilled and unskilled workers)</h5>\n<p>This visa is required if you are coming to the United States to perform a job which is temporary or seasonal in nature and for which there is a shortage of U.S. workers. Your employer is required to obtain a Department of Labor certification confirming that there are no qualified U.S. workers eligible for the type of employment on which your petition is based.</p>\n<h5>H-3 (trainee)</h5>\n<p>An H-3 visa is required if you are coming to the United States to receive training from an employer in any field of endeavor, other than graduate education or training, for a period of up to two years. You can be paid for your training and \"hands-on\" work is authorized. Training cannot be used to provide productive employment and cannot be available in your home country.</p>\n<h5>H-4 (dependents)</h5>\n<p>If you are the principal holder of a valid H visa, your spouse or unmarried children (under age 21) may receive an H-4 visa to accompany you to the United States. However, your spouse/children are not permitted to work while in the United States.</p>\n<h5>L-1 (intra-company transferees)</h5>\n<p>An L-1 visa is required if you are the employee of an international company which is temporarily transferring you to a parent branch, affiliate, or subsidiary of the same company in the United States. The international company may be either a U.S. or foreign organization. To qualify for an L-1 visa, you must be at the managerial or executive level, or have specialized knowledge and be destined to a position within the U.S. company at either of these levels, although not necessarily in the same position as held previously. In addition, you must have been employed outside the United States with the international company continuously for one year within the three years preceding your application for admission into the United States. You may only apply for an L-1 visa after your U.S. company or affiliate has received an approved petition from USCIS, either on a \"blanket\" or individual basis.</p>\n<h5>L-2 (dependents)</h5>\n<p>If you are the principal holder of a valid L visa, your spouse or unmarried children (under age 21) may receive this derivative visa. Due to a recent change in the law, your spouse may seek employment authorization. Your spouse must enter the United States on his or her own L-2 visa and then submit a completed <a href=\"https://uscis.gov/i-765\" target=\"_blank\" rel=\"noopener noreferrer\">Form I-765</a> (obtainable from USCIS), along with an application fee. Your children are not authorized to work in the United States.</p>\n<h5>O</h5>\n<p>Class O visas are issued to people with extraordinary ability in the sciences, arts, education, business and athletics, or extraordinary achievement in motion picture and television production, and their essential support personnel.</p>\n<h5>P (artists, entertainers)</h5>\n<p>Class P visas are issued to certain athletes, entertainers, artists and essential support personnel who are coming to perform in the United States.</p>\n<h5>Q</h5>\n<p>A Q visa is required if you are traveling to the United States to participate in an international cultural exchange program for the purpose of providing practical training, employment, and the sharing of the history, culture, and traditions of your home country. You must have a petition filed on your behalf by the program sponsor and the petition must be approved by USCIS.</p>\n<h4 id=\"WhentoApply\">When to Apply</h4>\n<p>The U.S. Embassy or Consulate may process your H, L, O, P or Q visa application up to 90 days prior to the beginning of employment status as noted on your I-797. However, when making your travel plans, please note that due to Federal regulations, you can only use the visa to apply for entry to the United States starting ten days prior to the beginning of the approved status period noted on your I-797.</p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>If you apply for an H, L, O, P, or Q visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>A receipt showing payment of your US$190 non-refundable nonimmigrant visa application processing fee paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>If you are an L-1 applicant on a blanket petition, you must pay a fraud prevention and detection fee (more information about this fee is <a href=\"pk-niv-visafeeinfo.asp#OtherFees\">here</a>).</li>\n<li>The receipt number printed on your approved I-129 petition. Paper copies of the I-797 are not required at the interview.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<h5>Step 1</h5>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\">U.S. Embassy or Consulate </a>on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months and your current and all old passports. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through this service. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of your information.</p>\n<p>Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p>If you are a first time visa applicant, you may save time by bringing the following documents to your interview:</p>\n<ul class=\"blue_bullets\">\n<li>Evidence that establishes your job qualifications, including any university diplomas.</li>\n<li>Original letters from current and previous employers detailing your position and projects you worked on and how long you worked with your employers.</li>\n<li>If you are currently working and holding H-1B status, please submit your pay slips for the current calendar year and your Federal tax returns (IRS Form 1040 and W-2) for all the years in which you have been employed in the United States. You should bring:\n<ul class=\"blue_bullets\">\n<li>pay slips from your current or most recent place of employment</li>\n<li>the names and current phone numbers of the personnel managers at your present and previous places of employment</li>\n<li>your resume or CV</li>\n</ul>\n</li>\n</ul>\n<h4 id=\"Dependents\">Dependents</h4>\n<p>Your dependents should bring all required documents for any nonimmigrant visa, plus:</p>\n<ul class=\"blue_bullets\">\n<li>An original marriage (for your spouse) and/or birth certificate (for unmarried children under 21), as applicable</li>\n<li>A letter from your employer confirming your continued employment</li>\n<li>If your spouse is currently working in the United States on an H1-B visa, his or her pay slips for the current calendar year and federal tax returns (IRS Form 1040 and W-2s) for all the years in which he or she has been employed in the United States on the H-1B visa.</li>\n</ul>\n<h4 id=\"MoreInformation\">More Information</h4>\n<p>For more information about H, L, O, P and, Q visas, visit the Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/employment/temporary-worker-visas.html\" target=\"_blank\" rel=\"noopener noreferrer\">Temporary Workers webpage</a>.</p></div>"}
][
{"name": "America", "visit_visa": "<div id=\"main-content\" class=\"editable\"><h2>Exchange Visitor Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#Dependents\">Dependents</a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#SupportingDocumentsforDependents\">Supporting Documents for Dependents</a></li>\n<li><a href=\"#MoreInformation\">More Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistj\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>The United States welcomes foreign citizens who come to the United States to participate in exchange programs. Before applying for a visa, all exchange visitor applicants are required to be accepted and approved by an authorized program sponsor. When accepted, the applicant will receive from the educational institution or program sponsors the necessary approval documentation to be submitted when applying for a visa.</p>\n<p>The exchange visitor program's J visa is designed to promote the interchange of persons, knowledge, and skills in the fields of education, arts, and sciences. Participants include students at all academic levels; trainees obtaining on-the-job training with firms, institutions, and agencies; teachers of primary, secondary, and specialized schools; professors coming to teach or do research at institutions of higher learning; research scholars; professional trainees in the medical and allied fields; and international visitors coming for the purpose of travel, observation, consultation, research, training, sharing, or demonstrating specialized knowledge or skills, or participating in organized people-to-people programs.</p>\n<h4 id=\"Dependents\">Dependents</h4>\n<p>Spouses or unmarried children under the age of 21 who wish to accompany or join the principal visa holder of a J-1 visa to the United States for the duration of his or her stay must have J-2 visas. Spouses or children who do not intend to reside in the United States with the principal visa holder, but who will visit for vacations only, may be eligible to apply for <a href=\"pk-niv-typeb1b2.asp\">visitor (B-2) visas</a>.</p>\n<p>The spouse and/or child of an exchange visitor in the United States may not work while holding a J-2 visa unless they have filed <a href=\"https://uscis.gov/i-765\" target=\"_blank\" rel=\"noopener noreferrer\">Form I-765</a>, Application for Employment Authorization. U.S. Citizenship and Immigration Services (USCIS) must have reviewed the Form I-765 and given permission to the J-2 holder to work. The USCIS website has a PDF document titled <a href=\"http://www.uscis.gov/USCIS/About%20Us/Electronic%20Reading%20Room/Customer%20Service%20Reference%20Guide/Employment_Authorization.pdf\" target=\"_blank\" rel=\"noopener noreferrer\">\"Employment Authorization\"</a> that has more information.</p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>To apply for a J visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>Unless your J program is sponsored by the United States Government (with a program code beginning with a \"G\"), you must present a receipt showing payment of your US$160 non-refundable nonimmigrant visa application processing fee, paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>An approved <a href=\"http://exchanges.state.gov/jexchanges/j-1_visas/ds-2019.html\" target=\"_blank\" rel=\"noopener noreferrer\">DS-2019</a> from your U.S. program.</li>\n<li>Unless your J program is sponsored by the United States Government (with a program code beginning with a \"G\"), you must pay your Form I-901 SEVIS <a href=\"pk-niv-visafeeinfo.asp#OtherFees\"> fee</a>. The SEVIS <a href=\"https://ice.gov/sevis\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> has more information.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<h5>Step 1</h5>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\">U.S. Embassy or Consulate </a> on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months, your current and all old passports, and the original visa fee payment receipt. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>Supporting documents are only one of many factors a consular officer will consider in your interview. Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of your information.</p>\n<p>You should bring the following documents to your interview:</p>\n<ul class=\"blue_bullets\">\n<li>Documents demonstrating strong financial, social, and family ties to your home country that will compel you to return to your country after your program of study in the United States ends.</li>\n<li>Financial and any other documents you believe will support your application and which give credible evidence that you have enough readily-available funds to meet all expenses for the first year of study and that you have access to funds sufficient to cover all expenses while you remain in the United States.</li>\n<li>Photocopies of bank statements will not be accepted unless you can also show original copies of bank statements or original bank books.</li>\n<li>If you are financially sponsored by another person, bring proof of your relationship to the sponsor (such as your birth certificate), the sponsor's most recent original tax forms and the sponsor's bankbooks and/or fixed deposit certificates.</li>\n<li>Academic documents that show scholastic preparation. Useful documents include school transcripts (original copies are preferred) with grades, public examination certificates (A-levels, etc.), standardized test scores (SAT, TOEFL, etc.), and diplomas.</li>\n</ul>\n<h4 id=\"SupportingDocumentsforDependents\">Supporting Documents for Dependents</h4>\n<p>If you have dependents, you must also provide:</p>\n<ul class=\"blue_bullets\">\n<li>Proof of your relationship to your spouse and/or child (e.g., marriage and birth certificates).</li>\n<li>Each spouse or child must have their own <a href=\"http://exchanges.state.gov/jexchanges/j-1_visas/ds-2019.html\" target=\"_blank\" rel=\"noopener noreferrer\">Form DS-2019</a>. This form is used to obtain the visa required for the spouse/child to enter the United States with you as the principal holder of an exchange visitor visa, or to join you in the United States at a later date.</li>\n</ul>\n<h4 id=\"MoreInformation\">More Information</h4>\n<p>For more information about visas for exchange visitors, visit the Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/study/exchange.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p></div>", "business_visa": "<div id=\"main-content\" class=\"editable\"><h2>Business/Tourist Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#Qualifications\">Qualifications </a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#SupportingDocumentsforApplicantsSeekingMedicalCare\">Supporting Documents for Applicants Seeking Medical Care</a></li>\n<li><a href=\"#MoreInformation\">More Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistb1b2\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>The B-1/B-2 visitor visa is for people traveling to the United States temporarily for business (B-1) or for pleasure or medical treatment (B-2). Generally, the B-1 visa is for travelers consulting with business associates, attending scientific, educational, professional or business conventions/conferences, settling an estate or negotiating contracts. The B-2 visa is for travel that is recreational in nature, including tourism, visits with friends or relatives, medical treatment and activities of a fraternal, social or service nature. Often, the B-1 and B-2 visas are combined and issued as one visa: the B-1/B-2.</p>\n<h4 id=\"Qualifications\">Qualifications</h4>\n<p>If you apply for a B-1/B-2 visa, you must demonstrate to a consular officer that you qualify for a U.S. visa in accordance with the U.S. Immigration and Nationality Act (INA). Section 214(b) of the INA presumes that every B-1/B-2 applicant is an intending immigrant. You must overcome this legal presumption by showing:</p>\n<ul class=\"blue_bullets\">\n<li>That the purpose of your trip to the United States is for a temporary visit, such as business, pleasure, or medical treatment</li>\n<li>That you plan to remain in the United States for a specific, limited period of time</li>\n<li>Evidence of funds to cover your expenses while in the United States</li>\n<li>That you have a residence outside the United States, as well as other binding social or economic ties, that will ensure your return abroad at the end of your visit</li>\n</ul>\n<p><a href=\"http://islamabad.usembassy.gov/domestic-employee.html\" target=\"_blank\" rel=\"noopener noreferrer\">Personal or domestic employees</a> and crew members working aboard vessels within the Outer Continental Shelf may qualify for B-1 visas under certain circumstances.</p>\n<p>Some foreign nationals may be ineligible for visas according to The Immigration and Nationality Act. You can read more about The Immigration and Nationality Act and visa ineligibility <a href=\"https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/waivers.html\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.</p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>If you apply for a business/tourist visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>A receipt showing payment of your US$160 non-refundable nonimmigrant visa application processing fee paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<p>Step 1</p>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\"> U.S. Embassy or Consulate </a>on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months and your current and all old passports. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>Supporting documents are only one of many factors a consular officer will consider in your interview. Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of the information.</p>\n<p>Additionally, based on your purpose of travel, you should consider bringing the following:</p>\n<h5>Students</h5>\n<p>Bring your latest school results, transcripts and degrees/diplomas. Also bring evidence of financial support such as monthly bank statements, fixed deposit slips, or other evidence.</p>\n<h5>Visiting a relative</h5>\n<p>Bring photocopies of your relative's proof of status (e.g. Green Card, naturalization certificate, valid visa, etc).</p>\n<h5>Previous visitors to the United States</h5>\n<p>If you were previously in the United States, any documents attesting to your immigration or visa status.</p>\n<h4 id=\"SupportingDocumentsforApplicantsSeekingMedicalCare\">Supporting Documents for Applicants Seeking Medical Care</h4>\n<p>If you wish to travel to the United States for medical treatment, then you should be prepared to present the following documentation in addition to the documents listed above and those the consular officer may require:</p>\n<ul class=\"blue_bullets\">\n<li>A medical diagnosis from a local physician explaining the nature of your ailment and the reason you require treatment in the United States.</li>\n<li>A letter from a physician or medical facility in the United States expressing a willingness to treat this specific ailment and detailing the projected length and cost of treatment (including doctors' fees, hospitalization fees, and all medical-related expenses).</li>\n<li>A statement of financial responsibility from the individuals or organization paying for your transportation, medical and living expenses. The individuals guaranteeing payment of these expenses must provide proof of their ability to do so, often in the form of bank or other statements of income/savings or certified copies of income tax returns.</li>\n</ul>\n<h4 id=\"MoreInformation\">More Information</h4>\n<p>For more information about business and tourist visas, visit the Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/tourism-visit/visitor.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p></div>", "study_visa": "<div id=\"main-content\" class=\"editable\"><h2>Student Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</a></li>\n<li><a href=\"#U.S.PublicSchools\">U.S. Public Schools</a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#Dependents\">Dependents</a></li>\n<li><a href=\"#OtherInformation\">Other Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistfandm\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>The United States welcomes foreign citizens who come to the United States to study. Before applying for a visa, all student visa applicants are required to be accepted and approved by their school or program. Once accepted, educational institutions will provide each applicant the necessary approval documentation to be submitted when applying for a student visa.</p>\n<h4 id=\"VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</h4>\n<h5>F-1 Visa</h5>\n<p>This is the most common type of student visa. If you wish to engage in academic studies in the United States at an approved school, such as an accredited U.S. college or university, private secondary school, or approved English language program then you need an F-1 visa. You will also need an F-1 visa if your course of study is more than 18 hours a week.</p>\n<h5>M-1 Visa</h5>\n<p>If you plan engage in non-academic or vocational study or training at a U.S. institution then you need an M-1 visa.</p>\n<p>More information about each of these visas and opportunities for studying in the United States can be found at the Education USA <a href=\"https://educationusa.state.gov/\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p>\n<h4 id=\"U.S.PublicSchools\">U.S. Public Schools</h4>\n<p>U.S. law does not permit foreign students to attend public elementary school (kindergarten to 8th grade) or a publicly funded adult education program. Hence, F-1 visas cannot be issued for study at such schools.</p>\n<p>An F-1 visa can be issued for attendance at a public secondary school (grades 9 to 12), but the student is limited to a maximum of 12 months at the school. The school must also indicate on the Form I-20 that the student has paid the unsubsidized cost of the education and the amount submitted by the student for that purpose.</p>\n<p>For more information about F-1 legal requirements, visit the Department of State <a href=\"https://travel.state.gov/content/travel/en/us-visas/study/student-visa/foreign-students-in-public-schools.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a>.</p>\n<p><strong>Note:</strong> Holders of A, E, F-2, G, H-4, J-2, L-2, M-2 or other derivative nonimmigrant visas may enroll in public elementary and secondary schools.</p>\n<h5>Student Assistance, Finding a U.S. School</h5>\n<p>Students who hope to enroll in a U.S. educational institution are encouraged to contact and visit <a href=\"https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/all-visa-categories.html\" target=\"_blank\" rel=\"noopener noreferrer\">https://travel.state.gov/content/travel/en/us-visas/visa-information-resources/all-visa-categories.html</a> and <a href=\"https://usefpakistan.org/\" target=\"_blank\" rel=\"noopener noreferrer\">www.usefpakistan.org</a></p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>To apply for an F or M visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>A receipt showing payment of your US$160 non-refundable nonimmigrant visa application processing fee paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>An approved Form I-20 from your U.S. school or program.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<h5>Step 1</h5>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\">U.S. Embassy or Consulate </a>on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months, your current and all old passports, and the original visa fee payment receipt. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>Supporting documents are only one of many factors a consular officer will consider in your interview. Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of your information.</p>\n<p>You should bring the following documents to your interview:</p>\n<ul class=\"blue_bullets\">\n<li>Documents demonstrating strong financial, social, and family ties to your home country that will compel you to return to your country after your program of study in the United States ends.</li>\n<li>Financial and any other documents you believe will support your application and which give credible evidence that you have enough readily-available funds to meet all expenses for the first year of study and that you have access to funds sufficient to cover all expenses while you remain in the United States. M-1 applicants must demonstrate the ability to pay all tuition and living costs for the entire period of their intended stay.</li>\n<li>Photocopies of bank statements will not be accepted unless you can also show original copies of bank statements or original bank books.</li>\n<li>If you are financially sponsored by another person, bring proof of your relationship to the sponsor (such as your birth certificate), the sponsor's most recent original tax forms and the sponsor's bankbooks and/or fixed deposit certificates.</li>\n<li>Academic documents that show scholastic preparation. Useful documents include school transcripts (original copies are preferred) with grades, public examination certificates (A-levels, etc.), standardized test scores (SAT, TOEFL, etc.), and diplomas.</li>\n</ul>\n<h4 id=\"Dependents\">Dependents</h4>\n<p>Spouses and/or unmarried children under the age of 21 who wish to accompany or join the principal visa holder in the United States for the duration of his or her stay require derivative F or M visas. There is no derivative visa for the parents of F or M holders.</p>\n<p>Family members who do not intend to reside in the United States with the principal visa holder, but wish to visit for vacations only, may be eligible to apply for visitor (B-2) visas.</p>\n<p>Spouses and dependents may not work in the United States on a derivative F or M visa. If your spouse/child seeks employment, the spouse must obtain the appropriate work visa.</p>\n<p>Supporting Documents for Dependents</p>\n<p>Applicants with dependents must also provide:</p>\n<ul class=\"blue_bullets\">\n<li>Proof of the student's relationship to his or her spouse and/or child (e.g., marriage and birth certificates)</li>\n<li>It is preferred that families apply for their visas at the same time, but if the spouse and/or child must apply separately at a later time, they should bring a copy of the student visa holder's passport and visa, along with all other required documents.</li>\n</ul>\n<h4 id=\"OtherInformation\">Other Information</h4>\n<h5>Optional Practical Training (OPT)</h5>\n<p>F-1 visa holders may be eligible for up to 12 months of optional practical training following completion of all course requirements for graduation (not including thesis or equivalent), or after completion of all requirements. OPT is separate from a student's academic work, and time for OPT will not normally be reflected during the student's academic program or in the completed study date. Students applying for an F visa to do OPT may present an I-20 with an original end of study date that may have passed. However, these I-20s must be annotated by the designated school official to reflect approval of an OPT program that extends beyond the end of the regular period of study. In addition, the student must have proof that USCIS has approved their practical training program or that an application is pending, either in the form of an approved Employment Authorization Card or a Form I-797 indicating that s/he has a pending application for an OPT program.</p>\n<h5>Validity of Student Visas After a Break in Studies</h5>\n<p>Students who are away from classes for more than five months can expect to apply for and receive a new F-1 or M-1 student visa to return to school following travel abroad, as explained below.</p>\n<h5>Students within the United States</h5>\n<p>A student (F-1 or M-1) may lose that status if they do not resume studies within five months of the date of transferring schools or programs, under immigration law. If a student loses status, unless USCIS reinstates the student's status, the student's F or M visa would also be invalid for future travel returning to the United States. For more information see the USCIS website, and instructions for Application for Extend/Change of Nonimmigrant Status Form I-539 to request reinstatement of status.</p>\n<h5>Students - Returning to the United States from Travel Abroad</h5>\n<p>Students who leave the United States for a break in studies of five months or more may lose their F-1 or M-1 status unless their activities overseas are related to their course of study. In advance of travel, students may want to check with their designated school official, if there is a question about whether their activity is related to their course of study.</p>\n<p>When the Customs and Border Protection (CBP) immigration inspector at port of entry is presented a previously used, unexpired F-1 or M-1 visa by a returning student who has been outside the United States and out of student status for more than five months, a CBP immigration inspector may find the student inadmissible for not possessing a valid nonimmigrant visa. CBP may also cancel the visa after granting the student permission to withdraw the application for admission. Therefore, it is prudent for students to apply for new visas at a U.S. Embassy or Consulate abroad prior to traveling to the United States to return to their studies, after an absence of more than five months that is not related to their course of study.</p></div>", "employment_visa": "<div id=\"main-content\" class=\"editable\"><h2>Work Visa</h2>\n<p><span class=\"tochead\">On this page:</span></p>\n<ul class=\"blue_bullets\">\n<li><a href=\"#Overview\">Overview</a></li>\n<li><a href=\"#VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</a></li>\n<li><a href=\"#WhentoApply\">When to Apply</a></li>\n<li><a href=\"#ApplicationItems\">Application Items</a></li>\n<li><a href=\"#HowtoApply\">How to Apply</a></li>\n<li><a href=\"#SupportingDocuments\">Supporting Documents</a></li>\n<li><a href=\"#Dependents\">Dependents</a></li>\n<li><a href=\"#MoreInformation\">More Information</a></li>\n</ul>\n<hr>\n<p><a href=\"pk-gen-faq.asp#qlistwork\">FAQ</a></p>\n<h4 id=\"Overview\">Overview</h4>\n<p>If you want to work in the U.S. temporarily as a nonimmigrant, under U.S. immigration law, you need a specific visa based on the type of work you will be doing. Most temporary worker categories require that your prospective employer or agent file a petition, which must be approved by the U.S. Citizenship and Immigration Services (USCIS) in the United States before you can apply for a work visa.</p>\n<p>All applicants for H, L, O, P and Q visas must have a petition approved on their behalf by USCIS. The petition, <a href=\"https://uscis.gov/i-129\" target=\"_blank\" rel=\"noopener noreferrer\">Form I-129</a>, must be approved before you can apply for a work visa at the U.S. Embassy or Consulate. When your petition is approved, your employer or agent will receive a Notice of Action, Form I-797, which serves as your petition's approval notification. The consular officer will verify your petition approval through the Department of State's Petition Information Management Service (PIMS) during your interview.</p>\n<p class=\"cms-float-left\" style=\"text-align: left;\">You must bring your I-129 petition receipt number to your interview at the U.S. Embassy or Consulate in order to verify your petition's approval. Please note that approval of a petition does not guarantee issuance of a visa if you are found to be ineligible for a visa under U.S. immigration law.</p>\n<h4 id=\"VisaDescriptionsandQualifications\">Visa Descriptions and Qualifications</h4>\n<h5>H-1B (specialty occupation)</h5>\n<p>An H-1B visa is required if you are coming to the United States to perform services in a pre-arranged professional job. To qualify, you must hold a bachelor's or higher degree (or an equivalent degree) in the specific specialty for which you seek employment. USCIS will determine whether your employment constitutes a specialty occupation and whether you are qualified to perform the services. Your employer is required file a labor condition application with the Department of Labor concerning the terms and conditions of its contract of employment with you.</p>\n<p style=\"margin: 0px 0px 0.8em; padding: 0px; border: 0px currentColor; text-align: justify; color: #222222; text-transform: none; text-indent: 0px; letter-spacing: normal; font-family: arial; font-size: 12px; font-style: normal; font-weight: normal; word-spacing: 0px; vertical-align: baseline; white-space: normal; orphans: 2; widows: 2; background-color: #ffffff; font-variant-ligatures: normal; font-variant-caps: normal; -webkit-text-stroke-width: 0px;\"><strong style=\"font-weight: bold;\">H-1B1 Treaty-based Temporary Work Visas</strong><br>Free trade agreements signed with Chile and Singapore permit qualified Chilean and Singaporean citizens to temporarily work in the United States in certain circumstances. Only Chilean and Singaporean citizens are eligible as principal applicants, although their spouses and children may be nationals of other countries.</p>\n<p>Applicants for H-1B1 visas should already have a job offer from an employer in their chosen work area in the United States, but the employer does not have to file Form I-129, Petition for Nonimmigrant Worker, and the applicant does not need to obtain a Notice of Approval, Form I-797 form before submitting the visa application. However, the petitioner does need to file an Application for Foreign Labor Certification with the Department of Labor prior to applying for the visa. For more information on the H-1B1 visa, please visit <a href=\"https://travel.state.gov/content/travel/en/us-visas/employment/temporary-worker-visas.html\" target=\"_blank\" rel=\"noopener noreferrer\">this page</a>.</p>\n<h5>H-2A (seasonal agricultural workers)</h5>\n<p>An H-2A visa allows U.S. employers to bring foreign nationals to the United States to fill temporary agricultural jobs for which U.S. workers are not available. An H-2A nonimmigrant classification applies to you if you seek to perform agricultural labor or services of a temporary or seasonal nature in the United States on a temporary basis. A U.S. employer (or an association of U.S. agricultural producers named as a joint employer) must file a Form I-129, Petition for Nonimmigrant Worker, on your behalf.</p>\n<h5>H-2B visa (skilled and unskilled workers)</h5>\n<p>This visa is required if you are coming to the United States to perform a job which is temporary or seasonal in nature and for which there is a shortage of U.S. workers. Your employer is required to obtain a Department of Labor certification confirming that there are no qualified U.S. workers eligible for the type of employment on which your petition is based.</p>\n<h5>H-3 (trainee)</h5>\n<p>An H-3 visa is required if you are coming to the United States to receive training from an employer in any field of endeavor, other than graduate education or training, for a period of up to two years. You can be paid for your training and \"hands-on\" work is authorized. Training cannot be used to provide productive employment and cannot be available in your home country.</p>\n<h5>H-4 (dependents)</h5>\n<p>If you are the principal holder of a valid H visa, your spouse or unmarried children (under age 21) may receive an H-4 visa to accompany you to the United States. However, your spouse/children are not permitted to work while in the United States.</p>\n<h5>L-1 (intra-company transferees)</h5>\n<p>An L-1 visa is required if you are the employee of an international company which is temporarily transferring you to a parent branch, affiliate, or subsidiary of the same company in the United States. The international company may be either a U.S. or foreign organization. To qualify for an L-1 visa, you must be at the managerial or executive level, or have specialized knowledge and be destined to a position within the U.S. company at either of these levels, although not necessarily in the same position as held previously. In addition, you must have been employed outside the United States with the international company continuously for one year within the three years preceding your application for admission into the United States. You may only apply for an L-1 visa after your U.S. company or affiliate has received an approved petition from USCIS, either on a \"blanket\" or individual basis.</p>\n<h5>L-2 (dependents)</h5>\n<p>If you are the principal holder of a valid L visa, your spouse or unmarried children (under age 21) may receive this derivative visa. Due to a recent change in the law, your spouse may seek employment authorization. Your spouse must enter the United States on his or her own L-2 visa and then submit a completed <a href=\"https://uscis.gov/i-765\" target=\"_blank\" rel=\"noopener noreferrer\">Form I-765</a> (obtainable from USCIS), along with an application fee. Your children are not authorized to work in the United States.</p>\n<h5>O</h5>\n<p>Class O visas are issued to people with extraordinary ability in the sciences, arts, education, business and athletics, or extraordinary achievement in motion picture and television production, and their essential support personnel.</p>\n<h5>P (artists, entertainers)</h5>\n<p>Class P visas are issued to certain athletes, entertainers, artists and essential support personnel who are coming to perform in the United States.</p>\n<h5>Q</h5>\n<p>A Q visa is required if you are traveling to the United States to participate in an international cultural exchange program for the purpose of providing practical training, employment, and the sharing of the history, culture, and traditions of your home country. You must have a petition filed on your behalf by the program sponsor and the petition must be approved by USCIS.</p>\n<h4 id=\"WhentoApply\">When to Apply</h4>\n<p>The U.S. Embassy or Consulate may process your H, L, O, P or Q visa application up to 90 days prior to the beginning of employment status as noted on your I-797. However, when making your travel plans, please note that due to Federal regulations, you can only use the visa to apply for entry to the United States starting ten days prior to the beginning of the approved status period noted on your I-797.</p>\n<h4 id=\"ApplicationItems\">Application Items</h4>\n<p>If you apply for an H, L, O, P, or Q visa, you must submit the following:</p>\n<ul class=\"blue_bullets\">\n<li>A Nonimmigrant Visa Electronic Application (DS-160) Form. Visit the <a href=\"pk-niv-ds160info.asp\">DS-160 web page</a> for more information about the DS-160.</li>\n<li>A passport valid for travel to the United States with a validity date at least six months beyond your intended period of stay in the United States (unless <a href=\"https://cbp.gov/document/bulletins/six-month-club-update\" target=\"_blank\" rel=\"noopener noreferrer\">country-specific agreements</a> provide exemptions). If more than one person is included in your passport, each person desiring a visa must submit an application.</li>\n<li>One (1) 2\"x2\" (5cmx5cm) photograph taken within the last six months. <a href=\"pk-niv-photoinfo.asp\">This web page</a> has information about the required photo format.</li>\n<li>A receipt showing payment of your US$190 non-refundable nonimmigrant visa application processing fee paid in local currency. <a href=\"pk-niv-visafeeinfo.asp\">This web page</a> has more information about paying this fee. If a visa is issued, there may be an additional visa issuance reciprocity fee, depending on your nationality. The Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/Visa-Reciprocity-and-Civil-Documents-by-Country.html\" target=\"_blank\" rel=\"noopener noreferrer\">website</a> can help you find out if you must pay a visa issuance reciprocity fee and what the fee amount is.</li>\n<li>If you are an L-1 applicant on a blanket petition, you must pay a fraud prevention and detection fee (more information about this fee is <a href=\"pk-niv-visafeeinfo.asp#OtherFees\">here</a>).</li>\n<li>The receipt number printed on your approved I-129 petition. Paper copies of the I-797 are not required at the interview.</li>\n<li>10-year travel history</li>\n<li>List of siblings and children</li>\n</ul>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through <a href=\"pk-niv-appointmentschedule.asp\">this service</a>. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<h4 id=\"HowtoApply\">How to Apply</h4>\n<h5>Step 1</h5>\n<p>Complete the <a href=\"pk-niv-ds160info.asp\">Nonimmigrant Visa Electronic Application (DS-160) form</a>.</p>\n<h5>Step 2</h5>\n<p>Pay the visa application <a href=\"pk-niv-paymentinfo.asp\">fee</a>.</p>\n<h5>Step 3</h5>\n<p>Schedule your appointment on <a href=\"https://cgifederal.secure.force.com/?language=English&amp;country=Pakistan\" target=\"_blank\" rel=\"noopener noreferrer\">this</a> web page. You will need the following information in order to schedule your appointment:</p>\n<ul class=\"blue_bullets\">\n<li>Your passport number</li>\n<li>The receipt number from your Visa Fee receipt. (Click <a href=\"pk-niv-paymentinfo.asp\">here</a> if you need help finding this number.)</li>\n<li>The ten (10) digit barcode number from your DS-160 confirmation page</li>\n</ul>\n<h5>Step 4</h5>\n<p>Visit the <a href=\"pk-loc-post.asp\">U.S. Embassy or Consulate </a>on the date and time of your visa interview. You must bring a printed copy of your appointment letter, your DS-160 confirmation page, one photograph taken within the last six months and your current and all old passports. Applications without all of these items will not be accepted.</p>\n<h4 id=\"SupportingDocuments\">Supporting Documents</h4>\n<p>In addition to these items, you must present an interview appointment letter confirming that you booked an appointment through this service. You may also bring whatever supporting documents you believe support the information provided to the consular officer.</p>\n<p><strong><span style=\"color: red;\">Caution:</span> Do not</strong> present false documents. Fraud or misrepresentation can result in permanent visa ineligibility. If confidentiality is a concern, please know that the U.S. Embassy or Consulate will not make your true information available to anyone and will respect the confidentiality of your information.</p>\n<p>Consular officers look at each application individually and consider professional, social, cultural and other factors during adjudication. Consular officers may look at your specific intentions, family situation, and your long-range plans and prospects within your country of residence. Each case is examined individually and is accorded every consideration under the law.</p>\n<p>If you are a first time visa applicant, you may save time by bringing the following documents to your interview:</p>\n<ul class=\"blue_bullets\">\n<li>Evidence that establishes your job qualifications, including any university diplomas.</li>\n<li>Original letters from current and previous employers detailing your position and projects you worked on and how long you worked with your employers.</li>\n<li>If you are currently working and holding H-1B status, please submit your pay slips for the current calendar year and your Federal tax returns (IRS Form 1040 and W-2) for all the years in which you have been employed in the United States. You should bring:\n<ul class=\"blue_bullets\">\n<li>pay slips from your current or most recent place of employment</li>\n<li>the names and current phone numbers of the personnel managers at your present and previous places of employment</li>\n<li>your resume or CV</li>\n</ul>\n</li>\n</ul>\n<h4 id=\"Dependents\">Dependents</h4>\n<p>Your dependents should bring all required documents for any nonimmigrant visa, plus:</p>\n<ul class=\"blue_bullets\">\n<li>An original marriage (for your spouse) and/or birth certificate (for unmarried children under 21), as applicable</li>\n<li>A letter from your employer confirming your continued employment</li>\n<li>If your spouse is currently working in the United States on an H1-B visa, his or her pay slips for the current calendar year and federal tax returns (IRS Form 1040 and W-2s) for all the years in which he or she has been employed in the United States on the H-1B visa.</li>\n</ul>\n<h4 id=\"MoreInformation\">More Information</h4>\n<p>For more information about H, L, O, P and, Q visas, visit the Department of State's <a href=\"https://travel.state.gov/content/travel/en/us-visas/employment/temporary-worker-visas.html\" target=\"_blank\" rel=\"noopener noreferrer\">Temporary Workers webpage</a>.</p></div>"}
]